Tekla.Structures.Drawing.PlacingTypes
The PlacingTypes class defines the different available placing types.
Please note that not all objects accept all types.
If you try to use the wrong type it will not be accepted (Insert, Modify will fail).

Tekla.Structures.Drawing.PlacingTypes.AlongLinePlacing(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
The object is located and moved along a line defined by two points.
StartPoint: The first point of the line.
EndPoint: The second point of the line.
Returns: A new along line placing instance.

Tekla.Structures.Drawing.PlacingTypes.BaseLinePlacing(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
The object is placed using a line as a reference.
This will thus define the object's X-axis along that line.
StartPoint: The first point of the line.
EndPoint: The second point of the line.
Returns: A new base line placing instance.

Tekla.Structures.Drawing.PlacingTypes.LeaderLinePlacing(Tekla.Structures.Geometry3d.Point)
The object is placed attached to a leader line.
LeaderLineStartPoint: The start point of the leader line.
Returns: A new leader line placing instance.

Tekla.Structures.Drawing.PlacingTypes.PointPlacing
The object is placed at one point (the insertion point) without any additional placing options.
Returns: A new point placing instance.